tap "d12frosted/emacs-plus"

brew "mas"
brew "ack"
brew "ansible"
brew "asdf"
brew "autoconf"
brew "awscli"
brew "coreutils"
brew "curl"
brew "fontconfig"
brew "fortune"
brew "git"
brew "htop"
brew "jq"
brew "libtool"
brew "libxslt"
brew "libyaml"
brew "markdown"
brew "openssl"
brew "ponysay"
brew "pipenv"
brew "readline"
brew "the_silver_searcher"
brew "tmux"
brew "unixodbc"
brew "unzip"
brew "vim"
brew "adr-tools"
brew "autojump"
brew "zsh"
brew "emacs-plus@29", args: ["with-imagemagick", "with-native-comp"]
brew "ripgrep"
brew "fd"
brew "cmake"
brew "aspell"
brew "direnv"
brew "editorconfig"
brew "isort"
brew "shfmt"
brew "shellcheck"
brew "neovim"

cask "alacritty"
cask "firefox@developer-edition"
cask "font-hack-nerd-font"
cask "font-open-sans"
cask "spotify"
cask "alfred"
cask "postman"
cask "rectangle"
cask "keymapp"
cask "elgato-stream-deck"

mas "Fantastical", id: 975937182
