tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/avr"
tap "px4/px4"

brew "ack"
brew "python"
brew "ansible"
brew "libusb"
brew "avrdude"
brew "awscli"
brew "cowsay"
brew "curl"
brew "dfu-programmer"
brew "dfu-util"
brew "docker-machine-driver-hyperkit"
brew "fontconfig"
brew "fortune"
brew "git"
brew "htop"
brew "hyperkit"
brew "jq"
brew "kubernetes-helm"
brew "markdown"
brew "ponysay"
brew "pulumi"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "osx-cross/avr/avr-gcc@7", link: true
brew "px4/px4/gcc-arm-none-eabi"

cask "alacritty"
cask "docker"
cask "dropbox"
cask "emacs"
cask "evernote"
cask "firefox-developer-edition"
cask "font-hack-nerd-font"
cask "font-open-sans"
cask "google-chrome"
cask "hammerspoon"
cask "minikube"
cask "reaper"
cask "signal"
cask "slack"
cask "vcv-rack"
cask "zoomus"
