tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/avr"
tap "px4/px4"
tap "d12frosted/emacs-plus"

brew "mas"
brew "ack"
brew "ansible"
brew "asdf"
brew "autoconf"
brew "avrdude"
brew "awscli"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "dfu-programmer"
brew "dfu-util"
brew "docker-machine-driver-hyperkit"
brew "fontconfig"
brew "fortune"
brew "git"
brew "htop"
brew "hyperkit"
brew "jq"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "libtool"
brew "libusb"
brew "libxslt"
brew "libyaml"
brew "markdown"
brew "openssl"
brew "osx-cross/avr/avr-gcc@7", link: true
brew "ponysay"
brew "pipenv"
brew "px4/px4/gcc-arm-none-eabi"
brew "readline"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "unixodbc"
brew "unzip"
brew "vim"
brew "adr-tools"
brew "autojump"
brew "zsh"
brew "emacs-plus"
brew "ripgrep"
brew "fd"

cask "alacritty"
cask "docker"
cask "dropbox"
cask "evernote"
cask "firefox-developer-edition"
cask "font-hack-nerd-font"
cask "font-open-sans"
cask "google-chrome"
cask "reaper"
cask "signal"
cask "slack"
cask "vcv-rack"
cask "gimp"
cask "skype"
cask "spotify"
cask "bitwarden"
cask "spideroakone"
cask "expressvpn"
cask "steam"
cask "obs"
cask "blender"
cask "alfred"
cask "postman"
cask "notion"

mas "Divvy", id: 413857545

#clj tools
tap "borkdude/brew"
brew "clj-kondo"
